crossref/scenarios/soap11_named_present.request.xml

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"><SOAP-ENV:Body><c:EchoNamed xmlns:c="http://crossref.example/controlled"><c:Value>soap11_named_value</c:Value></c:EchoNamed></SOAP-ENV:Body></SOAP-ENV:Envelope>
