crossref/scenarios/ns_prefix_shadowing.request.xml

<env:Envelope xmlns:env="http://www.w3.org/2003/05/soap-envelope" xmlns:x="urn:a"><env:Body xmlns:x="urn:b"><c:Echo xmlns:c="http://crossref.example/controlled"><c:Text>ns_prefix_shadowing</c:Text></c:Echo></env:Body></env:Envelope>
