crossref/scenarios/doc_literal_named_present.request.xml

<env:Envelope xmlns:env="http://www.w3.org/2003/05/soap-envelope"><env:Body><c:EchoNamed xmlns:c="http://crossref.example/controlled"><c:Value>named_test</c:Value></c:EchoNamed></env:Body></env:Envelope>
