crossref/scenarios/op_echo_special_chars.request.xml

<env:Envelope xmlns:env="http://www.w3.org/2003/05/soap-envelope"><env:Body><c:Echo xmlns:c="http://crossref.example/controlled"><c:Text>&lt;hello&gt; &amp; &apos;world&apos;</c:Text></c:Echo></env:Body></env:Envelope>
